---
title: PointCloudEngineRegistry
classe: Autodesk.Revit.DB.PointClouds.PointCloudEngineRegistry
namespace: Autodesk.Revit.DB.PointClouds
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# PointCloudEngineRegistry

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `IList<String> GetSupportedEngines()` | `PointCloudEngineRegistry.GetSupportedEngines()` | IList<String> |
| `Boolean IsEngineFileBased(String)` | `PointCloudEngineRegistry.IsEngineFileBased(identifier)` | Boolean |
| `Void RegisterPointCloudEngine(String, IPointCloudEngine, Boolean)` | `PointCloudEngineRegistry.RegisterPointCloudEngine(identifier, engine, isFileBased)` | Void |
| `Void UnregisterPointCloudEngine(String)` | `PointCloudEngineRegistry.UnregisterPointCloudEngine(identifier)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```